const str = `
010-1234-5678
thesexon@gmail.com
https://www.omdbapi.com/?apikey=285c915a&s=frozen
The quick brown fox jumps over the lazy dog.
abbcccdddd
http://localhost:1234
동해물과 백두산이 마르고 닳도록
`

console.log(
    str.match(/[fox]/g)
    //f또는o또는x
)

/* 
[결과]

['x', 'o', 'o', 'o', 'o', 'f', 'o', 'o', 'f', 'o', 'x', 'o', 'o', 'o', 'o']
*/


console.log(
    str.match(/[0-9]{1,}/g)
    //1개 이상 연속 일치하는 숫자 
)
/* 
[결과]
['010', '1234', '5678', '285', '915', '1234']
*/

console.log(
    str.match(/[가-힣]{1,}/g)
    //한글 모두 찾기.
    //1개이상 연속되는 모든 단어 찾기
)

/* 
[결과]
['동해물과', '백두산이', '마르고', '닳도록']
*/



console.log(
    str.match(/\w/g)
    // \w : 63개 문자(Word, 대소영문52개 + 숫자10개 + _)에 일치
)
/* 
[결과]
(128) ['0', '1', '0', '1', '2', '3', '4', '5', '6', '7', '8', 't', 'h', 'e', 's', 'e', 'x', 'o', 'n', 'g', 'm', 'a', 'i', 'l', 'c', 'o', 'm', 'h', 't', 't', 'p', 's', 'w', 'w', 'w', 'o', 'm', 'd', 'b', 'a', 'p', 'i', 'c', 'o', 'm', 'a', 'p', 'i', 'k', 'e', 'y', '2', '8', '5', 'c', '9', '1', '5', 'a', 's', 'f', 'r', 'o', 'z', 'e', 'n', 'T', 'h', 'e', 'q', 'u', 'i', 'c', 'k', 'b', 'r', 'o', 'w', 'n', 'f', 'o', 'x', 'j', 'u', 'm', 'p', 's', 'o', 'v', 'e', 'r', 't', 'h', 'e', 'l', 'a', 'z', 'y', 'd', 'o', …]
*/

console.log(
    str.match(/\b/g)
    // \b : 63개 문자에 일치하지 않는 문자 경계(Boundary)
)
/* 
[결과]
(54) ['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '']
*/


console.log(
    str.match(/\bf\w{1,}\b/g)
    //63개 문자가 아닌 경계에서 시작 + f라는 단어로 시작+ 63개 문자로 시작하는 1개 이상 + 63개 문자 아닌 경계까지
)

/* 
[결과]
 ['frozen', 'fox']
*/

console.log(
    str.match(/\d{1,}/g)

    //\d : 모든 숫자에 일치 + 1개이상
)
/* 
[결과]
 ['010', '1234', '5678', '285', '915', '1234']
 */


console.log(
    str.match(/\s/g)
    //모든 공백 검색
)
/* 
[결과]
['\n', '\n', '\n', '\n', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '\n', '\n', '\n', ' ', ' ', ' ', '\n']

줄바꿈 + 띄어쓰기
*/



const h = `  the hello world   !
`

console.log(
    h.replace(/\s/g,'')
    //모든 공백문자 삭제
)
/* 
[결과]
thehelloworld!
*/